<a href="https://colab.research.google.com/github/GuiSamuka/EloScience-Course/blob/main/02_An%C3%A1lise_dos_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Task 1 - Conhecer os dados**

In [ ]:
import pandas as pd

In [ ]:
dados = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Elo Science - Semana Data Science/sds_fifa.csv')

In [ ]:
# Obter o cabeçalho
dados.head()

          Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0   G. Obertan     31     CAM  ...   BB Erzurumspor      €7K         1753
1     P. Foden     20     CAM  ...  Manchester City     €95K         1997
2    S. García     29      ST  ...       Godoy Cruz     €12K         1847
3      Trincão     20      RW  ...     FC Barcelona     €95K         1906
4    A. Gignac     34      ST  ...  Tigres U.A.N.L.     €66K         2018

[5 rows x 8 columns]

In [ ]:
# Obter os últimos dados
dados.tail()

                Nome  Idade Posicao  ...               Time  Salario Total_Pontos
5995   D. Szoboszlai     19     CAM  ...         RB Leipzig     €27K         1967
5996   J. Bellingham     17      CM  ...  Borussia Dortmund      €6K         1962
5997      K. Havertz     21     CAM  ...            Chelsea     €95K         2048
5998       T. Almada     19     CAM  ...    Vélez Sarsfield      €9K         2001
5999         Emerson     21      RB  ...         Real Betis     €17K         2011

[5 rows x 8 columns]

In [ ]:
# Obter amostra aleatória
dados.sample(5)

                    Nome  Idade Posicao  ...           Time  Salario Total_Pontos
5556   Cristiano Ronaldo     35      ST  ...       Juventus    €220K         2221
2634       D. Szoboszlai     19     CAM  ...     RB Leipzig     €27K         1967
2485          N. Madueke     18      RM  ...            PSV      €5K         1792
846          J. Gvardiol     18      CB  ...  Dinamo Zagreb     €500         1836
1546        D. Upamecano     21      CB  ...     RB Leipzig     €41K         1841

[5 rows x 8 columns]

In [ ]:
# Obter informações sobre os dados
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6000 entries, 0 to 5999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          6000 non-null   object
 1   Idade         6000 non-null   int64
 2   Posicao       6000 non-null   object
 3   Media         6000 non-null   int64
 4   Potencial     6000 non-null   int64
 5   Time          6000 non-null   object
 6   Salario       6000 non-null   object
 7   Total_Pontos  6000 non-null   int64
dtypes: int64(4), object(4)
memory usage: 375.1+ KB

In [ ]:
# Obter o resumo estatístico
dados.describe().T

               count         mean         std  ...     50%     75%     max
Idade         6000.0    21.532333    4.872738  ...    21.0    23.0    38.0
Media         6000.0    78.268833    6.598193  ...    77.0    83.0    93.0
Potencial     6000.0    86.851667    4.625570  ...    87.0    89.0    95.0
Total_Pontos  6000.0  1927.909833  196.530184  ...  1962.0  2048.0  2336.0

[4 rows x 8 columns]

# **Task 2 - Transformar/Processar os nossos dados**

### Eliminar o sinal do euro na coluna Salario

In [ ]:
dados.Salario = dados.Salario.str.replace('€', '')

In [ ]:
dados.sample(5)

               Nome  Idade Posicao  ...                  Time  Salario Total_Pontos
5300     J. Musiala     17     CAM  ...     FC Bayern München       4K         1585
2202     J. Kimmich     25     CDM  ...     FC Bayern München     150K         2284
4957   M. Greenwood     18      RM  ...     Manchester United      33K         1922
3861     K. Adeyemi     18      ST  ...  FC Red Bull Salzburg       6K         1750
4197     K. Havertz     21     CAM  ...               Chelsea      95K         2048

[5 rows x 8 columns]

### Eliminar os dados vazios

In [ ]:
dados = dados.dropna()

In [ ]:
dados.head()

          Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0   G. Obertan     31     CAM  ...   BB Erzurumspor       7K         1753
1     P. Foden     20     CAM  ...  Manchester City      95K         1997
2    S. García     29      ST  ...       Godoy Cruz      12K         1847
3      Trincão     20      RW  ...     FC Barcelona      95K         1906
4    A. Gignac     34      ST  ...  Tigres U.A.N.L.      66K         2018

[5 rows x 8 columns]

Se quisermos saber se há algum valor NaN no DataFrame, podemos utilizar o método isnull().values.any() que retorna True se houver algum valor NaN no DataFrame e retorna False se não houver sequer uma única entrada NaN no DataFrame.

https://www.delftstack.com/pt/howto/python-pandas/how-to-check-if-nan-exisits-in-pandas-dataframe/

In [ ]:
dados.isnull().values.any()

False

### Conhecer valores únicos

In [ ]:
dados.Salario.unique()

array(['7K', '95K', '12K', '66K', '160K', '500', '18K', '14K', '120K',
       '110K', '6K', '3K', '70K', '50K', '90K', '23K', '67K', '4K', '54K',
       '560K', '40K', '5K', '82K', '24K', '29K', '210K', '42K', '75K',
       '220K', '33K', '45K', '25K', '240K', '150K', '41K', '76K', '59K',
       '135K', '2K', '27K', '9K', '17K', '61K', '270K', '16K', '28K',
       '77K', '11K', '100K', '155K', '44K', '10K', '195K', '46K', '175K',
       '13K', '58K', '1K', '55K', '47K', '39K', '53K', '20K', '370K',
       '125K', '250K', '550', '8K', '30K', '36K'], dtype=object)

In [ ]:
dados.Salario.nunique()

70

### Substituir k por 3 zeros

In [ ]:
dados.Salario = dados.Salario.str.replace('K', '000')

In [ ]:
dados.sample(5)

                    Nome  Idade Posicao  ...          Time  Salario Total_Pontos
1033            M. Mount     21     CAM  ...       Chelsea    70000         1997
2856   Cristiano Ronaldo     35      ST  ...      Juventus   220000         2221
4262           S. García     29      ST  ...    Godoy Cruz    12000         1847
752           F. de Jong     23      CM  ...  FC Barcelona   210000         2196
508            Ansu Fati     17      LW  ...  FC Barcelona    24000         1817

[5 rows x 8 columns]

### Transformando Salario para int64

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          6000 non-null   object
 1   Idade         6000 non-null   int64
 2   Posicao       6000 non-null   object
 3   Media         6000 non-null   int64
 4   Potencial     6000 non-null   int64
 5   Time          6000 non-null   object
 6   Salario       6000 non-null   object
 7   Total_Pontos  6000 non-null   int64
dtypes: int64(4), object(4)
memory usage: 421.9+ KB

In [ ]:
dados.Salario = dados.Salario.astype(str).astype(int)

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          6000 non-null   object
 1   Idade         6000 non-null   int64
 2   Posicao       6000 non-null   object
 3   Media         6000 non-null   int64
 4   Potencial     6000 non-null   int64
 5   Time          6000 non-null   object
 6   Salario       6000 non-null   int64
 7   Total_Pontos  6000 non-null   int64
dtypes: int64(5), object(3)
memory usage: 421.9+ KB

In [ ]:
dados.describe().T

               count          mean           std  ...      50%      75%       max
Idade         6000.0     21.532333      4.872738  ...     21.0     23.0      38.0
Media         6000.0     78.268833      6.598193  ...     77.0     83.0      93.0
Potencial     6000.0     86.851667      4.625570  ...     87.0     89.0      95.0
Salario       6000.0  65571.425000  87280.466527  ...  40000.0  95000.0  560000.0
Total_Pontos  6000.0   1927.909833    196.530184  ...   1962.0   2048.0    2336.0

[5 rows x 8 columns]

### Eliminar arquivos duplicados

In [ ]:
dados.drop_duplicates(inplace=True)

In [ ]:
dados = dados[['Nome', 'Idade', 'Posicao', 'Media', 'Potencial', 'Time', 'Salario', 'Total_Pontos']]

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 121 entries, 0 to 5253
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          121 non-null    object
 1   Idade         121 non-null    int64
 2   Posicao       121 non-null    object
 3   Media         121 non-null    int64
 4   Potencial     121 non-null    int64
 5   Time          121 non-null    object
 6   Salario       121 non-null    int64
 7   Total_Pontos  121 non-null    int64
dtypes: int64(5), object(3)
memory usage: 8.5+ KB

# **Task 3 - Responder algumas perguntas**

Quem é o jogador mais novo e o mais velho?

In [ ]:
dados[dados['Idade']==dados.Idade.min()]

          Nome  Idade Posicao  ...                Time  Salario Total_Pontos
29   R. Cherki     16      RW  ...  Olympique Lyonnais     6000         1622

[1 rows x 8 columns]

In [ ]:
dados[dados['Idade']==dados.Idade.max()]

               Nome  Idade Posicao  ...   Time  Salario Total_Pontos
22   Z. Ibrahimović     38      ST  ...  Milan    54000         2010

[1 rows x 8 columns]

Qual o jogador tem mais pontos no ranking?

In [ ]:
dados[dados['Total_Pontos']==dados.Total_Pontos.max()]

                Nome  Idade Posicao  ...               Time  Salario Total_Pontos
41   Bruno Fernandes     25     CAM  ...  Manchester United   240000         2336

[1 rows x 8 columns]

In [ ]:
dados[dados['Total_Pontos']==dados.Total_Pontos.max()].Nome

41     Bruno Fernandes
Name: Nome, dtype: object

Qual posição mais comum dos jogadores nos nossos dados?

In [ ]:
dados.Posicao.value_counts()

ST     19
CAM    16
CB     15
CM     15
RW     11
LW      9
RM      9
CDM     8
RB      7
LM      4
LB      3
GK      3
CF      1
RWB     1
Name: Posicao, dtype: int64

O time que mais aparece nos dados?

In [ ]:
dados.Time.value_counts().head()

FC Barcelona         10
Manchester City      10
Chelsea               6
FC Bayern München     6
Liverpool             5
Name: Time, dtype: int64

Qual é a pontuação (coluna Media) mais alta e a mais baixa?

In [ ]:
dados[dados['Media']==dados.Media.min()]

              Nome  Idade Posicao  ...               Time  Salario Total_Pontos
103   B. Arrey-Mbi     17      CB  ...  Bayern München II      500         1495

[1 rows x 8 columns]

In [ ]:
dados[dados['Media']==dados.Media.max()]

         Nome  Idade Posicao  ...          Time  Salario Total_Pontos
23   L. Messi     33      RW  ...  FC Barcelona   560000         2231

[1 rows x 8 columns]

Quem tem o maior e o menor salário?

In [ ]:
dados[dados['Salario']==dados.Salario.min()]

              Nome  Idade Posicao  ...               Time  Salario Total_Pontos
6      J. Gvardiol     18      CB  ...      Dinamo Zagreb      500         1836
45       A. Hložek     17      ST  ...       Sparta Praha      500         1881
47       C. Tzolis     18      LW  ...               PAOK      500         1815
103   B. Arrey-Mbi     17      CB  ...  Bayern München II      500         1495

[4 rows x 8 columns]

In [ ]:
dados[dados['Salario']==dados.Salario.max()]

         Nome  Idade Posicao  ...          Time  Salario Total_Pontos
23   L. Messi     33      RW  ...  FC Barcelona   560000         2231

[1 rows x 8 columns]

Qual é o salário do Cristiano Ronaldo?

In [ ]:
dados[dados['Nome']==' Cristiano Ronaldo']['Salario']

36    220000
Name: Salario, dtype: int64

Quantos time únicos existem?

In [ ]:
dados.Time.nunique()

58

Quantos jogadores ganham mais do que 100mil de salário?

In [ ]:
dados.Salario.value_counts()

6000      6
7000      6
40000     4
25000     4
500       4
         ..
36000     1
240000    1
14000     1
67000     1
175000    1
Name: Salario, Length: 70, dtype: int64

In [ ]:
dados[dados.Salario>=100000]

                     Nome  Idade  ... Salario  Total_Pontos
5             I. Gündoğan     29  ...  160000          2176
9                 Mariano     26  ...  120000          1984
10             Rúben Dias     23  ...  110000          1777
14                Alisson     27  ...  160000          1389
23               L. Messi     33  ...  560000          2231
30    T. Alexander-Arnold     21  ...  110000          2214
32             F. de Jong     23  ...  210000          2196
36      Cristiano Ronaldo     35  ...  220000          2221
39              K. Mbappé     21  ...  160000          2147
41        Bruno Fernandes     25  ...  240000          2336
42             J. Kimmich     25  ...  150000          2284
52            F. Valverde     21  ...  135000          2174
63            R. Sterling     25  ...  270000          2111
74               Raphinha     23  ...  100000          2071
76           João Cancelo     26  ...  155000          2199
79         Bernardo Silva     25  ...  195000          2119
80            M. Ødegaard     21  ...  135000          2096
81            M. Rashford     22  ...  150000          2158
84             O. Dembélé     23  ...  175000          1989
96         R. Lewandowski     31  ...  270000          2213
101             Neymar Jr     28  ...  270000          2175
104         Ferran Torres     20  ...  100000          1951
105                H. Son     27  ...  210000          2146
108           L. Goretzka     25  ...  120000          2296
109          K. De Bruyne     29  ...  370000          2303
110             T. Werner     24  ...  125000          2016
111              M. Salah     28  ...  250000          2211
115           V. van Dijk     28  ...  210000          2109

[28 rows x 8 columns]

In [ ]:
sal_100 = dados[dados.Salario>=100000]

In [ ]:
sal_100.Nome.nunique()

28

In [ ]:
len(dados[dados.Salario>=100000])

28

Qual é a média salarial dos 5 clubes mais comuns?

In [ ]:
dados.Time.value_counts().head()

FC Barcelona         10
Manchester City      10
Chelsea               6
FC Bayern München     6
Liverpool             5
Name: Time, dtype: int64

In [ ]:
a1 = dados[dados.Time=='FC Barcelona'].Salario.mean()

In [ ]:
a2 = dados[dados.Time=='Manchester City'].Salario.mean()

In [ ]:
a3 = dados[dados.Time=='Chelsea'].Salario.mean()

In [ ]:
a4 = dados[dados.Time=='FC Bayern München'].Salario.mean()

In [ ]:
a5 = dados[dados.Time=='Liverpool'].Salario.mean()

In [ ]:
(a1+a2+a3+a4+a5)/5

119593.33333333334

# Salvar dados atualizados

In [ ]:
dados.to_csv('sds_fifa_atualizado.csv', index = False)

In [ ]:
dados

                 Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0          G. Obertan     31     CAM  ...   BB Erzurumspor     7000         1753
1            P. Foden     20     CAM  ...  Manchester City    95000         1997
2           S. García     29      ST  ...       Godoy Cruz    12000         1847
3             Trincão     20      RW  ...     FC Barcelona    95000         1906
4           A. Gignac     34      ST  ...  Tigres U.A.N.L.    66000         2018
...               ...    ...     ...  ...              ...      ...          ...
116         A. Hakimi     21      RM  ...            Inter    90000         2150
117         M. Aarons     20      RB  ...     Norwich City     8000         1788
118     E. Smith Rowe     19     CAM  ...          Arsenal    30000         1719
119    Renato Sanches     22      CM  ...       LOSC Lille    36000         2176
5253      Eric García     19      CB  ...  Manchester City    42000         1693

[121 rows x 8 columns]